Repository: sofiiakopach/openregistry.assets.basic
Catalog: docs/source/locale/*/LC_MESSAGES/assets.po
Languages: uk

source: Retrieving Asset Information
uk: Отримання інформації про актив

source: Getting list of all assets
uk: Отримати список всіх активів

source: Getting list of all assets.
uk: Отримати список всіх активів

source: **Example request**:
uk: **Приклад запиту**:

source: **Example response**:
uk: **Приклад відповіді**:

source: Query Parameters
uk: Параметри запиту

source: offset number
uk: параметр, який ви повинні додати до вихідного запиту, щоб отримати наступну сторінку

source: limit number. default is 100
uk: обмеження кількості активів, що повертаються (дефолтне значення - 100)

source: Request Headers
uk: Заголовки запиту

source: optional OAuth token to authenticate
uk: необов'язковий токен OAuth для аутентифікації

source: Status Codes
uk: Коди стану

source: no error
uk: без помилок

source: endpoint not found
uk: ресурс не знайдено

source: Sorting
uk: Сортування

source: Assets returned are sorted by modification time.
uk: Повернені активи просортовані за датою модифікації.

source: Limiting number of Assets returned
uk: Обмеження кількості активів, що повертаються

source: You can control the number of `data` entries in the assets feed (batch size) with `limit` parameter. If not specified, data is being returned in batches of 100 elements.
uk: Ви можете контролювати кількість `data` записів потоку даних активів (розмір пакета) за допомогою параметра `limit`. Якщо він не вказаний, то дані будуть повернені пакетами по 100 елементів.

source: Batching
uk: Пакети

source: The response contains `next_page` element with the following properties:
uk: Відповідь містить елемент `next_page`з такими властивостями:

source: This is the parameter you have to add to the original request you made to get next page.
uk: Це параметр, який ви повинні додати до вихідного запиту, щоб отримати наступну сторінку.

source: This is path section of URL with original parameters and `offset` parameter added/replaced above.
uk: Це частина шляху URL-адреси з вихідними параметрами та доданим/заміненим `offset` параметром вище.

source: The full version of URL for next page.
uk: Повна версія URL-адреси для наступної сторінки.

source: If next page request returns no data (i.e. empty array) then there is little sense in fetching further pages.
uk: Якщо запит наступної сторінки повертається без даних (наприклад, пустий масив), тоді немає сенсу викликати сторінки далі.

source: Synchronizing
uk: Синхронізація

source: It is often necessary to be able to syncronize central database changes with other database (we'll call it "local"). The default sorting "by modification date" together with Batching mechanism allows one to implement synchronization effectively. The synchronization process can go page by page until there is no new data returned. Then the synchronizer has to pause for a while to let central database register some changes and attempt fetching subsequent page. The `next_page` guarantees that all changes from the last request are included in the new batch.
uk: Часто необхідно мати можливість синхронізувати зміни центральної бази даних з іншою базою даних (ми будемо називати її “локальною”). Стандартне сортування “за датою модифікації” разом із механізмом пакетування дозволяє ефективно здійснювати синхронізацію. Процес синхронізації може виконуватись посторінково, поки не буде жодних нових даних, що повертаються. Тоді синхронізатор призупиниться на деякий час, щоб дозволити центральній базі даних зареєструвати деякі зміни і спробувати завантажити наступну сторінку. next_page гарантує, що усі зміни з останнього запиту будуть включені у новий пакет.

source: The safe frequency of synchronization requests is once per 5 minutes.
uk: Безпечна частота запитів на синхронізацію - раз в 5 хвилин.

source: Reading the individual asset information
uk: Прочитати інформацію про окремі активи

source: Getting asset details.
uk: Отримати деталі активу

source: asset not found
uk: актив не знайдено
